#include <iostream>
using namespace std;
int main(){
	//选择结构 - 多条件if语句
	//输出考试分数，如果分数大于600；视为考上一本大学，在屏幕上输出
	//大于500，视为考上二本大学，在屏幕上输出
	//大于400，视为考上三本大学，在屏幕上输出
	//小于等于400分，视为未考上本科，在屏幕上输出
	
	//1.用户输入分数
	int score = 0;
	cout << "请输入一个考试分数:" << endl;
	cin>> score;
	
	
	
	//2.提示用户输入的分数
	cout << "您输入的分数为:" << score << endl;
	
	
	
	//3.判断
	//如果大于600，考上一本
	//如果大于500，考上二本
	//如果大于400，考上三本
	//前三个都没有满足，未考上本科
	if(score > 600){
		cout << "恭喜 考上一本大学" << endl;
	}
	else if(score > 500){//第二个条件判断
	    cout << "恭喜 考上二本大学" << endl;
		
	}
	else if(score > 400){//第三个条件判断
		cout << "恭喜 考上三本大学" << endl;
		
	}
	else
	{
		cout << "您未考上本科大学，请再接再厉，明年再来" << endl;
		
	}
	
	
	return 0;
	
}
